[
{"review": ["\nDuring recent months I was an IV patient at this facility on two occasions for a total of more than 40 days, and the four star rating which I have given above is with respect to staff only.  I  observed many systemic issues, a management responsibility, which I'll cover in a future review.\r\nIn particular, I wish to thank RN NoNa, RN Leah and Paul for their outstanding professional care and compassion.\r\nK\n", "\nI am so impressed by the integrity of this facility!  They were diligent and saved my husband's life.  Yes, there is a cultural disparity given the demographics of the area.  My husband didn't care!  He felt welcomed, included, and became involved.  I am in healthcare, and I saw they did everything by the book...family conferences, review of the plan of care, adjustments to meet specific patient needs.  The staff helped bring him to his best possible level, and he is happy!  The room was bright and sunny.  Staff called him by his name and title.  They recognized the activities he enjoyed and made sure he was participating.  Parking?  Not so good.  But, the goal is patient care and comfort, not how far I need to walk to visit!\n", "\nThis 5 Star facility took great pride in taking care of my grandmother. The nursing and rehab team was really great at encouraging my grandmother to take her meds and do her physical and occupational therapies. Grandma really liked playing Bingo with the activities team and she especially liked being pampered in Saturday's when Broadway's beauty shop was open for cut, color, sets. Great place highly recommend it!!\n\n", "\nMy father was in this facility only 10 days, He died. And unfortunately did not ever contacted to the patient family for eben, Condolences. And they never asked, What to do with my father belongings. The some of the staff from this facility has very poor device to the patients and the family members! Careless attitude, unfortunately.\n\n", "\nMy father was at Broadway Manor. My father had a private room because he is a veteran. It's awesome. The staff was helpful, polite, and treated him like he was their grandpa. There's not a lot of activities going on. He was just there for a month for rehab.\n\n", "\nExcellent facility! We researched many facilities and were fortunate to find Broadway Manor. The entire staff (Alex,Mike,Tonya, Zara,Miriam,Rico,Gilliyan, Nora) are fantastic to work with in managing our elderly family member's care.  They truly work together as a team, and completely inform us of any changes or concerns in our mother's care.  The facility is always extremely clean and all the residents appear to be well taken care of when we visit. The physical therapists are great and keep us aware of our mother's progress in rehabilitation.\n\n", "\nHe gets good care, and Broadway Manor contacts me if they change anything. Right now they don’t have long term space for him; that’s what I understand. The care from the nursing staff is good, very responsible, and always very cheerful, and it seems that my brother was taken care of. They have been highly cooperative with me, and I thought they were patient and professional. This week I dealt with the head nurse directly for the whole thing because they would going to try to keep that meeting yesterday, but they moved to Monday. She said she'd call me back to let me know, and she called me back.\n\n"], "medical_number": ["055670"], "name": ["\nBroadway Manor Care Center\n"]}
]