[{"review": ["\nHollenbeck Palms is a nice place, a good place. I went there first when I was considering my first choice for my aunt because I went there a couple of years ago for a funeral and I really liked it. Two years ago I wasn't visiting per se, I was just going there for a funeral and now I just found the locale and I just remembered it. When I went there for my aunt, I wasn't sure if it was reasonable, the price or the cost. I don't know what I'm looking at. Now we feel that, unfortunately, the care that my aunt needed is a little pricey there too for her. It's a little expensive, but I was very impressed that they have a gym, their dining hall is very nice, and I really like their chapel for religious services there. I like historical places, so I'm also impressed by that. The grounds are very nice, well kept, and maintained. Even the room that we looked at as a possible place for my aunt to stay was very nice. The only thing I was concerned about was that I know that in the shower she's gotta step up, but they did say they're able to redo that so that way it would just be a walk in.\n", "\nHollenbeck Palms was beautiful. It's just that they wanted half a million dollars to get in. The staff was terrific. They have a bar and dance halls. They have somebody there in assisted living all the time, but you're not locked in your room, you can leave anytime. Everything was nice. They take you wherever you need to go.\n", "\nHollenbeck Palms was nice, and the staff seemed very helpful. The rooms seemed OK, and the dining area seems nice. They had 3 meals a day, and everything was nice and fine.\n\n", "\nHollenbeck Palms is one of the oldest facilities in Los Angeles. The facility was excellent, and the personnel seemed to be well qualified. The members from the independent care were very friendly and very happy with the facility and the food. Because it was an older facility, the rooms were very spacious, and the dining room was spacious and very pleasant. The food was excellent. They had a pool, gym, very nice library, and game room.\n\n", "\nHollenbeck is a pretty nice place and well staffed. The building has been around for 100 years. They have several nice places to walk. They can cover the whole spectrum of issues with independent living and nursing staff that takes care of people if needed. For us, it’s pricey. If you want your laundry done, you pay for that or you could do it yourself. I thought the general atmosphere was nice. People weren’t running around smiling, but there was lots of space and nice dining facilities. They had other recreation facilities, like if you wanted to play games, and arranged trips. It had several buildings and was well landscaped.\n\n", "\nEverything at Hollenbeck Palms, like the rooms and staff, was just average. The people looked old. It was not very nice.\n\n", "\nMy cousin is at Hollenbeck Palms and the place is very nice. The grounds are very beautiful and the food is good. The people are very caring. They have a lot of activities but I don’t think he participates too much. He just reads the newspaper and watch T.V.\n\n", "\nEverything was good. I was impressed with Hollenbeck Palms. The rooms were very nice, and the food was OK. I didn't see many of the people; it was only during the lunch I had, but not in the facility. The staff was very nice, pleasant, polite, and caring, and they all sounded very good.\n\n", "\nI cannot say enough good things about Hollenbeck Palms. Although they have been in operation for 125 years, they have kept the place immaculately groomed & up to date. The staff are well trained, friendly, & helpful. Everyone there goes above & beyond to make sure everyone is healthy, happy & comfortable. With 24 hour gated security, my mom feels safe . It was important for her to know she won't have to move again. If she ever needs assisted living, or even long term medical care, they will help devise an individual plan that will best fit her needs. There is a 24 hr nursing staff that help with screenings, or friendly reminders for daily medications to constant care. A doctor is always available. What made my mom feel most special was the way they helped her design & decorate her room exactly how she wanted it. They even had carpet & tile & paint samples to choose from. She wanted the ability to cook for herself sometimes, so they actually ordered & installed an entire kitchenette in her space. Living here has been like being in an oasis right in the middle of the city. She enjoys the day trips as well as fitness classes, movie night & many new friends. She wanted to keep her car, but has come to enjoy the weekly shopping trips on the Hollenbeck van. They even go to her favorite stores  She has tried things she never imagined! We could not have imagined the new life she has found here. From everyone I've met, the experience has been better than expected. A bit expensive. But the peace of mind is well worth any sacrifice we made.\n\n", "\nWe visited Hollenbeck Palms. The staff was very good, very knowledgeable, and very helpful. The apartments were very nice. When you walked in, there was a bathroom to your left, and I believe it had railings and stuff to hold on. They had emergency buttons to press. It was a studio that we looked at. The dining room was very nice. The food was good. We ate at the bistro, and it was really good. The grounds were beautiful, and we saw a group of people walking.\n\n", "\nHollenbeck Palms is one of the best places around. The cost is a little bit steep, but I think it’s worth it. The staff was excellent, it’s clean, and it has a wonderful atmosphere.\n\nThey have a lot of activities like dancing, music, bingo nights, movie nights, and outings. They have a computer room, and they even have an ice cream parlor. The grounds were beautiful, there were flowers and plants. It’s a very sunny, beautiful place. It was excellent, and it was one of the best I have ever seen.\n\n", "\nThe staff at Hollenbeck Palms was wonderful. The dining area is very elegant, the facility was very large, and the rooms were spacious and well-appointed. The security was very good; we drove in, and there was a guard at the gate.\n\n", "\nWe have moved my wife’s parents in Hollenbeck Palms this week. I like it for the fact that it is continuing care. They have three facilities, and I like them. It is gorgeous. It is very well-staffed. The caregivers and every aspect of the staff that we have encountered were great. We have tasted the food, and it was excellent. They have multiple choices in every meal. They have 3 or 4 different activities every day like memory work, tai chi classes, walking club, music events, movies, and ice cream parlor. They have a chapel, and they have Christian and Catholic services.\n\n", "\nVery welcoming with options for care and plans for buy in. We will be taking mom for the complimentary lunch visit. I liked it for myself, will be leaving directives for my children to follow should I be in need.\n\n", "\nHollenbeck Palms was nice. The one who took us around, she was very nice, helpful, and informative. The rooms there were nice and clean. They had a therapy room, like a mini gymnasium, they had a chapel, and they also had a room like a library kind of thing where they can do handicrafts or just sit there and read a book.\n\n", "\nHollenbeck Palms was clean. The staff was very friendly and very accommodating. The rooms were very clean and very nice. That's why I decided to it would be good to settle then. The dining room was very large and clean with lots of tables. They had a lot of different activities there that a lot of people could relate to. There's a lot of music, a lot of interactive games like Sudoku, which I really love doing.\n\n", "\nHollenbeck Palms is phenomenal. The facility and staff are outstanding. The environment and the meals are beyond incredible. The apartments are phenomenally well cared for. The activities are numerous. They are in wide variety and flexible topics. They have card games, movie and music activities. They have field trips to concerts, operas and theaters. They make arrangements for people to come to their facility as well as for the residents to go out to local venues. I am so pleased and lucky that my mom is there.\n\n", "\nMy grandfather moved to Hollenbeck Home once he started having trouble walking. At first he was very apprehensive but grew to love it. The Facility itself is gorgeous and offers many different activity's for the elderly. He was able to take an assortment of classes which kept him active and the nurses that handled his personal care were all very friendly and professional. He had countless options to fill his days and was also encouraged to try things I never thought he would ie. Karaoke and to my surprise table tennis. His personal living quarters were surprisingly roomy and had all the necessary safety and support implements. The have a game room, library, gym, pool hall, even a putting green plus many more amenities. His favorite was the ice creme parlor. Hollenbeck Homes allowed my grandfather to live the rest of his years in comfort and enjoyment and I thank them for that. I would recommend this care home to anyone.\n\n", "\nI think Hollenbeck assisted living facility is a beautiful facility. While there, I witnessed the staff members taking care of the residences like they are their own family members. They place looks well taken care off, clean and organzied. They also have relaxation activities and the whole environment looks very welcoming.\n\nIn general, I would rank this facility five out of five stars.\n\n", "\nThe apartments at Hollenbeck Palms were beautiful. They had a lecture while I was there. I stayed for lunch and they showed me the different rooms and different activities they had. The food was very good. The lady who showed me around was very helpful, considerate, and did a good job. I was impressed with the whole thing. I liked it very much. I went with a friend and she was also impressed. This place was established in 1890 and they have kept the grounds meticulous. The buildings are in excellent shape and the facilities were very nice. They just finished building a skilled nursing center and they are working now on building a memory facility there. They offer everything that I would be interested in.\n", "\nI had a good experience with Hollenbeck Palms, it was really beautiful, and the rooms were fine. The price was of good value, and the location was very convenient. They had a lot of activities.\n\n", "\nI liked Hollenbeck Palms, but I didn’t like the neighborhood so well. The staff was very nice.\n\n", "\nHollenbeck Palms was nice, and I enjoyed it. It was old Spanish in some ways but modern enough. It's been updated over the years, so it looked very nice. The camaraderie among the people that were there was positive. Everybody was friendly. The food was excellent. The rooms were spacious. The open interaction of the people that lived there was very relaxed. The chef came to our table, and I'm sure it was part of their presentation, but it was well done.\n\n", "\nI stayed at Hollenbeck Palms and I didn't like it because there were people coming in my room. The staff appeared to be nice, but I thought they were passive aggressive. The food was excellent, and the dining area was very nice. They had buffets for breakfast and dinner, and for lunch you had a sit-down meal. It was very well maintained and the people that worked there appeared to be very nice. The single room was nice. I wasn't there that long, but I had planned to participate in their activities. When people live in independent living and they don't need assistance from the nurses on a regular basis, they don't come in your room to see you there, like if you don't show up for lunch, etc.\n\n", "\nMy wife wasn't happy with the Hollenbeck Palms' neighborhood. As far as the facility, it was OK. The person during the tour was mostly OK, but a little abrupt with my wife about whether or not she'd be in the skilled nursing or assisted living section. There were two dining areas, one was more formal, and one was less formal. The apartments were OK, and they have an exercise room. The staff was helpful.\n", "\nMy husband is at Hollenbeck Palms and the facility is clean. The staff were friendly and everybody is nice.\n\n"], "medical_number": ["055115"], "name": ["\nHollenbeck Palms\n"]}
]