[
{"review": ["\nSmall, dirty, smelly rooms shared between two residents for $6000/month per resident. \r\nThey over-medicate residents to ensure they can't function (five different blood-pressure medications sent my family member into a BP crisis of 70/45; normal is 120/80). No AC or water provided during 100+ Degree weather. We had to fight the useless, bottom-of-barrel employees to bring our family-member a pitcher of water every single day. \r\nNo food provided or blatantly lying about providing food/residents eating it (family-member was unresponsive for three days before we managed to convince them to call 911 and transport to ER, but they kept assuring us she was eating a \"great\" breakfast despite not being able to speak or move thanks to a combination of being medicated to literal death, excessive heat, no water, and no treatment). \r\nThis is supposedly a health-care centre, but family-member was transported to hospital after going into septic shock thanks to a catheter that wasn't clean and hadn't been checked the entire duration of her stay (my mother finally noticed no urine inside the bag), and a minor stroke had neither been noticed, diagnosed, or attended to. Again, how a \"health-care\" centre managed to miss all of this is unforgivable. It is murder by negligence. Dr Shahnazarian never visited her despite multiple requests and the nursing home employees never followed-through with getting this greedy, useless, inept doctor to visit despite promised appointments. \r\nMy family-member died due to a combination of extremely low blood-pressure, sepsis and stroke, and it is fully the responsibility of this facility for getting her to that point as she went in with only a catheter issue, fully alert, and fully cognitively functional. There was nothing wrong with her other than being bed-ridden, and she declined in a matter of days after being transported to this facility. All at a cost of $6000/month. \r\nPlease check on your family-members/friends if you have any in there. Having been inside there initially, then restricted to out-doors due to Covid, I witnessed nothing but ineptitude and an uneducated/unprofessional/completely apathetic staff. After seeing what this place does to its residents, my heart breaks for any-one who ends up there, or has to watch a loved one go in there. It is absolutely one of the worst places I have ever been to, and I used to work with a foster-child agency. Please be careful with your loved ones if they are in there.\n", "\nClothing thief\r\nIn the first week and a half, with clothing clearly mark as to his room number, my brother lost two good shirts and a vest. I there fore had a notice pasted on his closet door that  a member of his family would wash his clothes. Things went well until I bought him a NEW pair of pants and within three days it had gone missing . I advise you only bring the patient old or very used clothing to wear.I was very disappointed with the response I got when I reported the items missing.                                         \n", "\nAutumn Hills is good, but my relative has to move to an assisted living facility. The food is very good. Everything is very good. Sometimes, they have people come in to sing. They also have film shows, and they play bingo.\n\n", "\nMy dad is currently in Autumn Hills a skilled nursing home. He's been there about a month now. He's current Medicaid and medical assisted waiver program right now. He ended up with cancer and it's really not easy for him and for all of us. He's really not doing good at all with his current situation with this nursing home. I don't think they are treating my dad with the right care he deserves. It's really a rough place and the food is also terrible. So he's really not happy being in that facility. It was actually his doctor who chose this nursing home for him. So I am really not satisfied with the service at all. He's 96 years old and frail. I guess they need to be more caring and attentive with all the patients they have.\n\n"], "medical_number": ["055288"], "name": ["\nAutumn Hills Health Care\n"]}
]