[
{"review": ["\nMy mother was at this facility this for 13 days after a hospital stay and surgery. She was supposed to have breathing treatments every 4 hours, she never got a single one. They mixed up her medications, threw out things the hospital has sent with her, lost her shoes and gave her pain killers at night. She wasn't in pain, they told her they would help her sleep. The room smelled awful because they never changed her roommates diaper. The lan refused to tell her what pills she was taking. My mother is back in the hospital because they didn't notice she was going into congestive heart failure. Fortunately my mother will be ok and will not go back there.\n\n\n\n\n", "\nI was imprisoned here for a week after knee replacement surgery, when the expected rehab unit at the hospital did not have the bed open that they expected. The physical therapy staff are excellent. Nothing else about this place even rates an acceptable rating. My medication was never right, the food I was served nearly always contained something to which I was allergic, or was on my \"does not like\" list, which the dietician wrote up, and was on my tray at every meal. The doctor assisgned to me never once in seven days showed his face in my room (two of his PAs did visit, two out of my seven days). This despite repeated requests from me to the staff, the nursing supervisor and the director, and requests form my usual caregiver directly to the doctor's office. I was in a 3 bed room, although I have insurance which covered the cost of a two-bed room. On the third day, a resident was transferred into the room, and took an immediate dislike to me, before I even learned her name. She was constantly telling me that I didn't like her, and she would move as soon as she could. I couldn't even talk to her without her getting hysterical. And physical therapy was very limited, not like I was scheduled to receive at the other facility. The only two bright spots were my middle roommate, who was very nice, and the PT staff, who were wonderful.\n\n", "\nBurbank Healthcare & Rehabilitation Center is pretty nice. There are three or four beds to a room. I know that my grandmother doesn’t really like the food at all, but that is because she is 97 and doesn't like anything really, and that is the one complaint that she has. It seems clean and everybody is very helpful. She is just older and says that they are a little rough on her sometimes like when they are changing her and stuff, but they seem nice.\n\n", "\nMy brother was transferred to this location for Hospice in November, 2013. Please DO NOT do this to your loved one. I had a total different vision of what a Hospice facility would be like. The evening he was admitted, I met with a Hospice Nurse in very noisy hallway, no privacy whatsoever. The first room my brother was in was small and had three beds. My brother was placed in the middle, it was so crowded that I couldn’t even sit beside him. I had to sit at the foot of his bed, although he was not conscience, I still felt the need to have private time with him but couldn’t. Thank God he was not conscience of his surroundings.\n\nThe following day, a representative stopped by to speak to me and I voiced my displeasure of where my brother was placed and the experience I had the day he was admitted. She claimed that she was going to report my conversation with the Administration Office but still nothing was done nor did I hear back from her. On the third day, I was asked to stop by the Admitting Office to sign papers, again I voiced my displeasure of the whole situation and finally broke down in tears. It wasn’t until then did the person find another room to transfer him to. He was transferred to another room still with three beds but had more room and placed in the furthest bed, at least I was able to sit near him. To think that a person who is in their last days of their life is treated with no care or dignity is truly unacceptable.\n\n", "\nIt's a clean center and there's no smell. My mother had been in a different rehab center before but Burbank Healthcare has no urine smell at all. It's very clean and the walls are shiny. There's wallpaper on the walls and it's just comfortable. The staff are very nice. My mom is happier with the place compared to the previous one. I haven't eaten there yet but the food looks good also.\n\n", "\nMy father suffered a massive stroke which left him without his speech.  We had 3 days to find a healthcare facility and after looking at even sadder places settled upon Burbank Healthcare and Rehab. My Dad's mind was still sharp and my Mother or myself would go every day to feed him.  During his stay there we encountered a myriad of problems and stress from the facility and their staff.  First of all, they do not change the patient's diapers regularly and the ratio of nurses to patients is staggering, that is their excuse for doing a minimal job.  They deprive patients of water so they have less diapers to change and honestly, 75% of the patients are dehydrated due to this. Most of the patients upon seeing me every day and who could speak, would always ask me for a cup of water or assistance.  Actually, my fiance and I were reprimanded for helping other patients whether it be to be wheeled down the hall or given a beverage.  The food was substandard and most of the nurses would shove food down the poor patients throats to the point of them choking. I have witnessed all of this firsthand. God forbid your loved one is incapacitated or cannot speak because the neglect is unfathomable. The smell of feces is prevalent and they leave the diaper cart in the hallways so the smell permeates throughout the entire facility and into the patient's rooms.  The majority of nurses are lazy, rude and downright ignorant.  The good workers always leave for better jobs and the lazy mean ones remain to collect their paychecks.  When I expressed my concerns to the head nurse, her response was that \"then go somewhere else\".  All I was trying to do was make sure my father was changed regularly and that his smelly roommate (the man never bathed)turned down the loud television. My requests were simple and few, I just wanted my father to have some peace and dignity during his final days.   If a loved one is of the Jewish faith, I would highly recommend The Jewish Home for the Ageing (long waiting list).  I wept when we visited that facility because it was so clean and civilized, the opposite of this filthy prison. Please be very careful where you place your loved ones. I am grateful that we got to see my father every day and keep an eye on him. He would have died sooner than he did had my Mother and I not watched over him daily.  Soon after my father was first admitted there, he contacted MRSA, the nurses first said \"it's nothing\", but thank God my mother knew it looked dangerous and took him to a specialist.  When my father had a malignant cancer growth on his elbow, they told us it was \"a wart\" and to tie a string around it!  Again, we took him to the doctor to have it removed.  Basically it is really scary how ignorant people are in these positions of authority.  Whenever I would report anything to the Head Nurse,  she would babble and ask me questions about my personal life, in lieu of answering and addressing my concerns, she chose to cover up for her cruel crew's ineptitude. I would not recommend this torture chamber to anybody - Please protect your loved ones. Do not be fooled that they are located next to Calvary Church who by the way, sends volunteers (converts) to FORCE people into accepting Jesus in order to get to heaven. This facility breaks spiritual and physical laws every day.  The parking lot is shared with the church and the hospital visitors are limited in spaces and although the workers are not supposed to park in the visitors lot, they do so all the time.  Again, I have seen and experienced all this first hand. Please be careful in choosing a facility and make sure you or a trusted loved one keeps tabs daily if possible.\n\n"], "medical_number": ["056129"], "name": ["\nBurbank Healthcare & Rehab\n"]}
]