[
{"review": ["\nFrequently it is impossible to get anyone to answer calls to the facility office.  This time I have called for 5 straight days and no one answers.  \n", "\nNot enough help!!! My mother laid in feces 41/2hrs,it was horrible.I didn't feel comfortable with my mother there at all.There's so many problems with this place,I don't even know where to start.Warning,those that are thinking about this place for a loved one,please think again,it's horrible! !!!- Physical therapy was good-my advice hire more CNA's! !!!\n\n", "\nI don't like this place at all! They have bad service, the nurses are so rude and don't help right away. They don't care if you eat or not they take their time to go see what's wrong with a patient even Thoe the patient press the button frequently. They give you attitude and bothered when you ask for things. I don't recommend this place to no one my dad was here and they were letting him died. Even those he came\nHere walking and talking moving around on his own. We got him out only in bones and non speaking or moving.\n\n", "\nSituated in a busy commercial area, Bloomfield East is a large nursing home facility that serves the basic needs of its residents. This older facility is located on a corner with high traffic.  It has a plain, off-white exterior with windows dressed with brown awnings. Parking can be found on the street or at the facility's designated parking area.  Benches provide outdoor seating for residents or visitors located near the parking area.\n\nOverall, the interior is plain, with basic colors and old tile floors.  Rooms are shared and each bed is curtained off, if there is need for privacy.  Residents seem to have good interactions with each other.  Staff members are skilled and competent and provide residents with basic, adequate nursing care.  Bloomfield East does a good job, considering their size.\n\n", "\nThe facilities are not kept very well. The patients are also not cared for. There was an older gentleman and we saw him leave the facility in the morning. At around 6pm that evening my husband was coming home from work on his scooter and he saw him trying to cross the street. He actually pulled into the parking lot and helped this gentleman get up onto the curb(He was in a wheelchair) My husband asked him where he was going and he couldnt even tell him. He was disoriented and lost. He asked him for his name and the gentleman showed him a bracelet and saw that this is where he lived. So he walked this man to the nursing home and realized that is where he lived because he waved to another patient so he went in the he had to search for nurse to tell her that he had found him on the street and on top of that they didnt even know he was gone! My husband than told her where he had found him and she didnt even take notes or anything. My husband also asked her if he had to take some sort of medicine or something because he had seen him leave this morning and he is sure he did not come back all afternoon because he was hungry and didnt even know where he was. She still made no comment to his concern.\n\n", "\nHigh turn over in personel. Poor equipment. Call button did not work for several MONTHS! Male attendants for female patients w/o female attendant.Male patients harassing female patients. Many safety issues.\n"], "medical_number": ["055052"], "name": ["\nCalifornia Post Acute Care\n"]}
]