[
{"review": []}
][
{"review": ["\nAfter reading the other reviews left on this page, I knew I had to write one of my own.  The staff at Burns goes above and beyond.  My mother was very reluctant to be admitted, but she ended up loving it even more than I could have hoped.  The staff is kind and compassionate, and the activities provided kept her mind active and engaged.  The food....oh my goodness...the food was just like home.  It was always well-prepared and delicious.  Every single staff member made it a point to show my mother they cared and genuinely wanted her to be comfortable and content.  They also wanted her to know that they cared about her as a person, not just as someone on the hall they cared for to do their job.  The quality of care at Burns is the type care you would want for your loved one, and it is without a doubt the cleanest nursing home I have ever been inside.  \n", 
    "\nI have nothing but good things to say about Burns Nursing Home. My Mother received the very best care from each and every employee in all departments.. It was so much a family environment. All the employees seemed so happy all of the time. If ,at any time, my family need to be placed in a Nursing Home. This will be our first choice. Keep up the good work Burns !!\n\n", 
    "\nWhen we decided to put our mother in Burns Nursing Home for Rehab we visited the facility and thought it would be a good fit. The Staff was so great on the Rehab side and they seemed to really care about the patients. So when the time of Rehab was reached we moved mom to the Resident side for further care and to continue her Rehab.  It feels like a bait and switch method is being used there and the Site Doctor visits once a month. Our mother passed away after being there for only 3 months., The family is very unsatisfied with the care she received.  I would not recommend sending a loved one there if you are expecting quality care.  I feel that the staff did very little to assist with the kind of care our mother and the rest of the patients required.  You cannot just let someone lay there and die without making every attempt to help.  They were not forthcoming in keeping the family informed with the truth of her condition. We do not understand how someone can just let someone lay in there own urine or bowel movements for hours without cleaning them up.  Forget about pulling the cord for the nurse to assist it takes hours before they even come in the room.  There was no quality of life there for our mother.  I have never been so unsatisfied with care of any kind from a medical facility.\n\n", 
    "\nI went there expecting it to be a nice facility with all the patients and staff happy with nothing but smiles. When I got there the staff looked miserable and so did the patients. It made me sad just to walk into the place and see everyone's faces and feel the depression looming in the main room from all the patients. The facility ended up dropping my ex's grandmother one day and did not notify the family, and a little later the bruise from the fall, the family found out that it had been worse than imagined and it turned into gangrene. This resulted in the grandmother dying so I for one will never ever send any of my loved ones there.\n\n"]}
]